prathapreddy4023/prared/nRF5_SDK_12.2.0_f012efa/examples/ble_central/ble_app_multilink_central/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    uint32_t err_code;

   //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    NRF_LOG_INFO("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!\r\n",
                    p_evt->conn_handle,
                    p_evt->conn_handle);
    ble_lbs_on_db_disc_evt(&m_ble_lbs_c[p_evt->conn_handle], p_evt);
}


/** @brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}



/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
/////////////Dharmesh Added/////////////////////////////////

uint8_t simple_uart_get(void)
{
  while (NRF_UART0->EVENTS_RXDRDY != 1)
  {
    // Wait for RXD data to be received
  }
  
  NRF_UART0->EVENTS_RXDRDY = 0;
  return (uint8_t)NRF_UART0->RXD;
}
void simple_uart_put(uint8_t cr)
{
  NRF_UART0->TXD = (uint8_t)cr;

  while (NRF_UART0->EVENTS_TXDRDY!=1)
  {
    // Wait for TXD data to be sent
  }

  NRF_UART0->EVENTS_TXDRDY=0;
}
void simple_uart_putstring(const uint8_t *str)
{
  uint_fast8_t i = 0;
  uint8_t ch = str[i++];
  while (ch != '\0')
  {
    simple_uart_put(ch);
    ch = str[i++];
  }
}
void simple_uart_config(  uint8_t rts_pin_number,
                          uint8_t txd_pin_number,
                          uint8_t cts_pin_number,
                          uint8_t rxd_pin_number,
                          bool hwfc)
{
  nrf_gpio_cfg_output(txd_pin_number);
  nrf_gpio_cfg_input(rxd_pin_number, NRF_GPIO_PIN_NOPULL);  

  NRF_UART0->PSELTXD = txd_pin_number;
  NRF_UART0->PSELRXD = rxd_pin_number;

  if (hwfc)
  {
    nrf_gpio_cfg_output(rts_pin_number);
    nrf_gpio_cfg_input(cts_pin_number, NRF_GPIO_PIN_NOPULL);
    NRF_UART0->PSELCTS = cts_pin_number;
    NRF_UART0->PSELRTS = rts_pin_number;
    NRF_UART0->CONFIG  = (UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
  }

  NRF_UART0->BAUDRATE         = (UART_BAUDRATE_BAUDRATE_Baud9600 << UART_BAUDRATE_BAUDRATE_Pos);
  NRF_UART0->ENABLE           = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
  NRF_UART0->TASKS_STARTTX    = 1;
  NRF_UART0->TASKS_STARTRX    = 1;
  NRF_UART0->EVENTS_RXDRDY    = 0;
}
int main(void)
{
		uint8_t cr ='\0';
    ret_code_t err_code;
	//simple_uart_config(RTS_PIN_NUMBER, TX_PIN_NUMBER, CTS_PIN_NUMBER, RX_PIN_NUMBER, HWFC);
		simple_uart_config(RTS_PIN_NUMBER,15, CTS_PIN_NUMBER,17, HWFC);
//		simple_uart_putstring((const uint8_t *)" \n\rplay pressed");
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    //NRF_LOG_INFO("Multilink Example\r\n");
    leds_init();
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
    buttons_init();
    ble_stack_init();

    db_discovery_init();
    lbs_c_init();
		
    // Start scanning for peripherals and initiate connection to devices which
    // advertise.
    scan_start();

    // Turn on the LED to signal scanning.
    bsp_board_led_on(CENTRAL_SCANNING_LED);
	//	if(cr)
	//	led_status_send_to_all(1);
		for (;;)
    {
			//power_manage();
			cr = simple_uart_get();
				if(cr==0x31)//driver up
				{	
				led_status_send_to_all(1);
				//led_status_send_to_all(0);	
				}	
				else if(cr==0X32)// driver down
				{
				led_status_send_to_all(2);
				//led_status_send_to_all(0);
				}
				else if(cr==0X33) //front passenger up
				{
				led_status_send_to_all(3);
				//led_status_send_to_all(0);
				}	
				else if(cr==0X34)//front passenger down
				{
				led_status_send_to_all(4);//
				//led_status_send_to_all(0);
				}
					else if(cr==0X35)// rear right up
				{
				led_status_send_to_all(5);//6
				//led_status_send_to_all(0);
				}
					else if(cr==0X36)// rear right down
				{
				led_status_send_to_all(6);//6
				//led_status_send_to_all(0);
				}
					else if(cr==0X37)// rear left up
				{
				led_status_send_to_all(7);//6
				//led_status_send_to_all(0);
				}
				else if(cr==0X38)// rear left down
				{
				led_status_send_to_all(8);//6
				//led_status_send_to_all(0);
				}
				else if(cr==0X39)// light's on
				{
				led_status_send_to_all(9);//6
				//led_status_send_to_all(0);
				}
				else if(cr==0X40)//light's off 
				{
				led_status_send_to_all(10);//6
				//led_status_send_to_all(0);
				}
				else if(cr==0X41)// butten release
				{
				led_status_send_to_all(0);//6
				//led_status_send_to_all(0);
				}
				else
				{
				//simple_uart_putstring((const uint8_t *)" \n\r wrong enter");
				}				
		}
/*			
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            // Wait for BLE events.
            power_manage();
        }
    }*/
}
